---
kind: method
id: M:Autodesk.Revit.DB.Document.Equals(System.Object)
zh: 文档、文件
source: html/f0efbd19-9399-1ee7-96e5-fe1dbbaa0815.htm
---
# Autodesk.Revit.DB.Document.Equals Method

**中文**: 文档、文件

Determines whether the specified Object equals to this Object .

## Syntax (C#)
```csharp
public override bool Equals(
	Object obj
)
```

## Parameters
- **obj** (`System.Object`)

## Remarks
Two document instances are considered equal if they represent the same document currently opened in the Revit session.